app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
    def index
        properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
    def show
        property = Property.find(params[:id])

INSERT INTO "agents" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jeremy Rodriguez"], ["created_at", "2021-01-28 04:14:06.662555"], ["updated_at", "2021-01-28 04:14:06.662555"]]
SELECT "agents".* FROM "agents" WHERE "agents"."name" = ? LIMIT ?  [["name", "Jeremy Rodriguez"], ["LIMIT", 1]]
INSERT INTO "properties" ("address", "image", "status", "agent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        new_id = Agent.find_or_create_by(name: params[:agent]).id
        property = Property.create(address: params[:address], image: params[:image], status: params[:status], agent_id: new_id)

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "properties" SET "status" = ?, "updated_at" = ? WHERE "properties"."id" = ?  [["status", "Active"], ["updated_at", "2021-01-28 20:05:11.760463"], ["id", 1]]
---
    def update
        property = Property.find(params[:id])
        property.update(status: params[:status])

DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 34]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
    def destroy
        Property.find(params[:id]).destroy